---
kind: method
id: M:Autodesk.Revit.DB.DirectContext3D.DirectContext3DHandleOverrides.Assign(Autodesk.Revit.DB.DirectContext3D.DirectContext3DHandleOverrides)
zh: 赋值、设置值、写入
source: html/ea14e22b-e17a-bb85-3317-219b0f553635.htm
---
# Autodesk.Revit.DB.DirectContext3D.DirectContext3DHandleOverrides.Assign Method

**中文**: 赋值、设置值、写入

Assigns values of the source overrides to this object.

## Syntax (C#)
```csharp
public void Assign(
	DirectContext3DHandleOverrides other
)
```

## Parameters
- **other** (`Autodesk.Revit.DB.DirectContext3D.DirectContext3DHandleOverrides`) - The source overrides.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null